main = [
    # 0x
    "[Awaiting Response]", "[Linebreak]", "[Bartz]", "クリスタル", "タイクーン", "ファファ", "じゃ", "いる", "　", "　　", "　　　", "魔物", "[Fixed Pause]", "風の神殿", "飛竜", "[Auto Close]",

    # 1x
    "[Gil]", "[Item]", "[Ability]", "封印", "シド 「", "ミド 「", "世界", "", "エクスデス", "レナ 「", "ガラフ 「", "ファリス 「", "クルル 「", "おじいちゃん",

    # 1E
    "王行力様飛世界封入城竜士船印海父人見魔物大者本何戦出気手言石守辺無心間前風帰私生年武器兵火使中急時森来砂動女待臣地助当今上悪泉騎思持変水塔草仲復目作分知機一姫最聞械神流乗取町殿事空勇村早子　　伝消書長話合所場脱北後全忍獣詩吟落自階説残親活休姉破土度記発赤侍死国旅完小林古図礼商島邪部狩精姿防向先解板下台賢対木成命配法飲回願門東開貸増危館道身老西近　第青光読外理強同谷負意学攻屋体運河聖必南方黒絶食艇山穴名受暁傷少鼻　　的男用酒安現代立具育続通会　　日窟砲広化博以兄室洞別番昔住吸去宝毒売好枝踊月巣底明感宿召喚決形",

    # 1F
    "団異初険家息連集墓着跡遺内悲教返頭再高借登走過敵鏡愛魚燃幅音血滝次閉求声箱軍泣　　　憶潜爆恋右左役放衛母建　信師元失字派遊　震　追暗橋起約束文反　能歌弱境波　　炎望雨金希花不白剣陸勝鳥　究三探夜病半美敗友研予支々除数店翼充填薬弟　　値闘　闇　乱点速　射　　　　電　圧昇重倍　　拡散影　正漠特胸永遠議浮眠逃滅口極　利周緑切紙夢平和宇宙則孤",

    # 2x
    "バ", "ば", "ビ", "び", "ブ", "ぶ", "ベ", "べ", "ボ", "ぼ", "ガ", "が", "ギ", "ぎ", "グ", "ぐ",

    # 3x
    "ゲ", "げ", "ゴ", "ご", "ザ", "ざ", "ジ", "じ", "ズ", "ず", "ゼ", "ぜ", "ゾ", "ぞ", "ダ", "だ",

    # 4x
    "ヂ", "ぢ", "ヅ", "づ", "デ", "で", "ド", "ど", "ヴ", "パ", "ぱ", "ピ", "ぴ", "プ", "ぷ", "ペ",

    # 5x
    "ぺ", "ポ", "ぽ", "０", "１", "２", "３", "４", "５", "６", "７", "８", "９", "", "", "",

    # 6x
    "ハ", "は", "ヒ", "ひ", "フ", "ふ", "ヘ", "へ", "ホ", "ほ", "カ", "か", "キ", "き", "ク", "く",

    # 7x
    "ケ", "け", "コ", "こ", "サ", "さ", "シ", "し", "ス", "す", "セ", "せ", "ソ", "そ", "タ", "た",

    # 8x
    "チ", "ち", "ツ", "つ", "テ", "て", "ト", "と", "ウ", "う", "ア", "あ", "イ", "い", "エ", "え",

    # 9x
    "オ", "お", "ナ", "な", "ニ", "に", "ヌ", "ぬ", "ネ", "ね", "ノ", "の", "マ", "ま", "ミ", "み",

    # Ax
    "ム", "む", "メ", "め", "モ", "も", "ラ", "ら", "リ", "り", "ル", "る", "レ", "れ", "ロ", "ろ",

    # Bx
    "ヤ", "や", "ユ", "ゆ", "ヨ", "よ", "ワ", "わ", "ン", "ん", "ヲ", "を", "ッ", "っ", "ャ", "ゃ",

    # Cx
    "ュ", "ゅ", "ョ", "ょ", "ァ", "ー", "ィ", "…", "ゥ", "！", "ェ", "？", "ォ", "！！", "／", "って",

    # Dx
    "「", "」", "。", "Ａ", "Ｂ", "手に入れ", "Ｙ", "Ｌ", "Ｒ", "ない", "Ｈ", "Ｍ", "Ｐ", "……", "だいじょうぶ", "は、",

    # Ex
    "んだ", "てい", "した", "、", "して", "『", "お父様", "！？", "です", "（", "）", "この", "の力", "ケルガー", "古代図書館", "言って",

    # Fx
    "へいし 「", "から", "かりょくせん", "海ぞく", "いじょう", "が、", "たち", "たの", "ます", "ください", "かった", "た!", "に、", "いないからなんだ", "次元の狭間", "　"
]

main_rules = {
    0x17: "pause_s",
    0x1e: "str_i",
    0x1f: "str_i"
}


battle = main[:]

for i in range(0x1f):
    battle[i] = ""

battle[5] = "　"
battle[0x16] = "[Bartz]"
battle[0xcd] = "％"

battle_rules = {
    5: "times_then_dec"
}

menu = main[:]


new_menus = [
    [
        "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ",
        "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "[stone]", "[frog]", "[mini]", "[float]", "[poison]", "[death]",
        "[blind]"
    ],

    [
        "↑", "→", "＋", "[sw]", "[wh]", "[bk]", "[tm]", "[dg]", "[sp]", "[ax]", "[kt]", "[rd]", "[sf]", "[bw]", "[hp]", "[wp]",
        "[bl]", "[sh]", "[hm]", "[ar]", "[rl]", "Ｕ"
    ]
]

NEW_MENU_OFFSETS = [0x20, 0xe0]

for i in range(len(new_menus)):
    for j in range(len(new_menus[i])):
        menu[NEW_MENU_OFFSETS[i] + j] = new_menus[i][j]

menu[0x51] = "゛"
menu[0x52] = "゜"
menu[0x5D] = "Ｍ"
menu[0x5E] = "Ｈ"
menu[0x5F] = "Ｐ"
menu[0x67] = "‥"
menu[0x6D] = "％"
menu[0x6F] = "："


text = [
    {
        "texts": main,
        "rules": main_rules
    },

    {
        "texts": battle,
        "rules": battle_rules
    },

    {
        "texts": menu,
        "rules": {}
    }
]